<!DOCTYPE html>
<html lang="es">
<head>
 <meta charset="UTF-8">
 <meta name="viewport" content="width=device-width, initialscale=1.0">
 <meta name="description" content="Historia de las aplicaciones web,
sus orígenes, evolución y el impacto actual.">
 <meta name="keywords" content="Historia, Web, Aplicaciones,
Evolución">
 <title>Historia de Aplicaciones Web</title>
 <style>
body {
		 text-align:center;
		 background-color:black;
		 font-family: Arial, sans-serif;
		 color:white;
		 margin: 20px;
		 line-height: 1.6;
		 }
		 header, section {
		 margin-bottom: 20px;
		 }
		 h1, h2 {
		 color: #24ede3;
		 }
		 .subtitulo { color: #18a38c;
		}
		

 </style>
</head>
<body>
 <nav>
 <a href="index.html">Inicio</a>
 <a href="historia.html">Historia Web</a>
 <a href="cv.html">CV</a>
 </nav>
 <header>
 <h1>Historia de Aplicaciones Web</h1>
 <p>Explora los hitos históricos de la web.</p>
 </header>
	 <section id="origenes">
		 <h2>Orígenes</h2>
		 <p>Las aplicaciones web tienen sus or&iacute;genes en la d&eacute;cada de 1990 con la creaci&oacute;n de p&aacute;ginas est&aacute;ticas basadas en 
		 HTML y CSS, donde los sitios solo mostraban informaci&oacute;n sin posibilidad de interacci&oacute;n. Con el tiempo, la necesidad de mayor dinamismo
		 llev&oacute; al uso de tecnolog&iacute;as como JavaScript, PHP y ASP, junto con bases de datos como MySQL, lo que permiti&oacute; el desarrollo de 
		 aplicaciones din&aacute;micas como foros, blogs y plataformas de comercio electr&oacute;nico. A partir de 2005, la Web 2.0 revolucion&oacute; la 
		 forma en que los usuarios interactuaban con la web mediante tecnolog&iacute;as como AJAX, facilitando la actualizaci&oacute;n de contenido en tiempo
		 real y dando paso a redes sociales y servicios colaborativos como Facebook y Google Docs. Posteriormente, con la llegada de HTML5, CSS3 y frameworks
		 como Angular, React y Vue, las aplicaciones web se volvieron m&aacute;s r&aacute;pidas, responsivas y capaces de funcionar en m&uacute;ltiples 
		 dispositivos sin necesidad de instalar software adicional. Hoy en d&iacute;a, las aplicaciones web han evolucionado a&uacute;n m&aacute;s 
		 con el uso de inteligencia artificial, computaci&oacute;n en la nube y Progressive Web Apps (PWA), ofreciendo experiencias avanzadas, 
		 personalizadas y accesibles desde cualquier parte del mundo.
		</p>
		
		<p>Las primeras aplicaciones web surgieron como simples documentos de hipertexto accesibles a trav&eacute;s de navegadores,
		permitiendo la distribuci&oacute;n de informaci&oacute;n de manera global. Durante los primeros a&ntilde;os, la web estaba
		compuesta por sitios est&aacute;ticos con contenido fijo, sin posibilidad de interacci&oacute;n con los usuarios. Sin embargo,
		con la necesidad de mayor dinamismo, se implementaron tecnolog&iacute;as como CGI (Common Gateway Interface) y bases de datos
		para permitir la generaci&oacute;n de contenido en tiempo real. Esto marc&oacute; el inicio del desarrollo de aplicaciones web
		m&aacute;s complejas, allanando el camino para el comercio electr&oacute;nico, los foros y las primeras plataformas de 
		gesti&oacute;n de contenido.</p>
		
		 <a href="#evolucion">Siguiente: Evolución</a>
	 </section>
	 
	 <section id="evolucion">
	 
		 <h2>Evolución</h2>
		 <p>Las aplicaciones web han evolucionado significativamente desde sus inicios en la d&eacute;cada de 1990. En sus primeros a&ntilde;os, eran
		 p&aacute;ginas est&aacute;ticas creadas con HTML y CSS, con contenido fijo y sin interacci&oacute;n con el usuario. Con el avance de la 
		 tecnolog&iacute;a, surgieron lenguajes como JavaScript, PHP y ASP, permitiendo el desarrollo de aplicaciones din&aacute;micas que interactuaban
		 con bases de datos y ofrec&iacute;an contenido personalizado. Durante la Web 2.0, a partir de 2005, el uso de AJAX permiti&oacute; actualizar 
		 partes de una p&aacute;gina sin necesidad de recargarla, impulsando redes sociales, blogs y plataformas colaborativas. Con la llegada de HTML5
		 y CSS3, las aplicaciones web se volvieron m&aacute;s r&aacute;pidas, adaptables y capaces de funcionar en m&uacute;ltiples dispositivos. 
		 Actualmente, el desarrollo web ha integrado inteligencia artificial, computaci&oacute;n en la nube y Progressive Web Apps (PWA), ofreciendo
		 experiencias avanzadas, accesibles y personalizadas desde cualquier parte del mundo. </p>
		 
		 <p>Con el avance de la tecnolog&iacute;a, las aplicaciones web han pasado de ser simples contenedores de informaci&oacute;n 
		 a herramientas avanzadas con funcionalidades interactivas. Durante la transici&oacute;n a la Web 2.0, los usuarios comenzaron
		 a participar activamente en la generaci&oacute;n de contenido, lo que impuls&oacute; el desarrollo de redes sociales, plataformas 
		 de colaboraci&oacute;n en l&iacute;nea y sistemas de gesti&oacute;n empresarial. Hoy en d&iacute;a, la evoluci&oacute;n 
		 contin&uacute;a con la integraci&oacute;n de APIs, frameworks modernos como React y Angular, y la implementaci&oacute;n de
		 tecnolog&iacute;as como WebAssembly, que permite ejecutar c&oacute;digo de alto rendimiento directamente en el navegador.</p>
		 
		 <a href="#impacto">Siguiente: Impacto Actual</a>
	 </section>
 
	 <section id="impacto">
		 <h2>Impacto Actual</h2>
		 <p>Las aplicaciones web tienen un impacto fundamental en la sociedad moderna, transformando la manera en que las personas trabajan, se 
		 comunican y acceden a la informaci&oacute;n. Gracias a tecnolog&iacute;as como la computaci&oacute;n en la nube, la inteligencia artificial
		 y las Progressive Web Apps (PWA), las aplicaciones web ofrecen experiencias r&aacute;pidas, seguras y accesibles desde cualquier dispositivo
		 con conexi&oacute;n a Internet. Empresas, instituciones educativas y gobiernos dependen de plataformas web para la gesti&oacute;n de datos, 
		 la automatizaci&oacute;n de procesos y la prestaci&oacute;n de servicios en l&iacute;nea. Adem&aacute;s, el comercio electr&oacute;nico ha 
		 crecido exponencialmente, permitiendo a los usuarios comprar y vender productos en tiempo real. La seguridad tambi&eacute;n ha evolucionado, 
		 con protocolos como HTTPS y la autenticaci&oacute;n multifactor para proteger la informaci&oacute;n de los usuarios. En la actualidad, las 
		 aplicaciones web contin&uacute;an innovando con tecnolog&iacute;as emergentes, garantizando un acceso m&aacute;s inclusivo y eficiente a servicios
		 digitales en todo el mundo.</p>
		 
		 <p>El impacto de las aplicaciones web en la actualidad es innegable, abarcando desde el entretenimiento hasta la educaci&oacute;n 
		 y el comercio global. Empresas y usuarios dependen de servicios en l&iacute;nea para realizar transacciones, acceder a contenido 
		 multimedia y colaborar en proyectos a distancia. Adem&aacute;s, la adopci&oacute;n de tecnolog&iacute;as como el almacenamiento en 
		 la nube y la inteligencia artificial ha mejorado la eficiencia y la personalizaci&oacute;n de estas aplicaciones. Gracias a la 
		 optimizaci&oacute;n en seguridad y rendimiento, las aplicaciones web se han convertido en la base de la econom&iacute;a digital, 
		 permitiendo el acceso a servicios desde cualquier parte del mundo con solo una conexi&oacute;n a Internet.</p>
		 
		 <a href="#origenes">Volver al Inicio de la Historia</a>
	 </section>
 
</body>
</html>